## 1. Sqlite
Sqlite merupakan salah satu bagian dari light-weight database yang cenderung lebih ringan dibanding dengan jenis RDBMS lainnya seperti mysql ataupun postgresql

In [2]:
# import sqlite package
import sqlite3
import pandas as pd

In [3]:
#membuat database baru dengan sqlite 
conn = sqlite3.connect('/Users/jojomac/introduction_python/database/test_db.db/')

In [4]:
#cur atau cursor untuk menyatakan koneksi sqlite yang sedang aktif
cur = conn.cursor()

## 2. Basic Query

### 2.1 CREATE
CREATE meruapakan salah satu kueri yang digunakan untuk Data Defenition Languange (DDL) untuk membuat database baru

In [5]:
#create table employee
cur.execute('''CREATE TABLE employee (
              id INT, 
              name TEXT, 
              departement TEXT
            )''')

In [6]:
#create tabel departement
cur.execute('''CREATE TABLE departement (
              id INT, 
              departement_name TEXT
            )''')

In [7]:
#mengecek table yang masuk ke database test_db
cur.execute("SELECT name FROM sqlite_master WHERE type = 'table';")
print(cur.fetchall())

[('employee',), ('departement',)]

In [8]:
#insert data ke tabel yang baru dibuat
cur.execute("INSERT INTO employee VALUES (1,'Rian','HR'),(2,'Giggs','IT')")
cur.execute("INSERT INTO departement VALUES ('D01','HR')")

In [9]:
#commit digunakan apabila dilakukan perubahan pada database 
conn.commit()

In [10]:
pd.read_sql_query("SELECT * FROM employee", conn)

   id   name departement
0   1   Rian          HR
1   2  Giggs          IT

In [11]:
pd.read_sql_query("SELECT * FROM departement", conn)

    id departement_name
0  D01               HR

In [12]:
#open sample database 
conn_1 = sqlite3.connect('/Users/jojomac/introduction_python/database/chinook.db')

#membuat cursor
c_1 = conn_1.cursor()

In [13]:
c_1.execute("SELECT name FROM sqlite_master where type = 'table'")

In [14]:
#cek kolom yang ada pada sample database
print(c_1.fetchall())

[('albums',), ('sqlite_sequence',), ('artists',), ('customers',), ('employees',), ('genres',), ('invoices',), ('invoice_items',), ('media_types',), ('playlists',), ('playlist_track',), ('tracks',), ('sqlite_stat1',)]

### 2.2 SELECT
SELECT merupakan kueri yang digunakan untuk get atau fetch data dari database

In [15]:
sqlite_sample = pd.read_sql_query('select * from albums', conn_1)

In [16]:
sqlite_sample

     AlbumId                                              Title  ArtistId
0          1              For Those About To Rock We Salute You         1
1          2                                  Balls to the Wall         2
2          3                                  Restless and Wild         2
3          4                                  Let There Be Rock         1
4          5                                           Big Ones         3
..       ...                                                ...       ...
342      343                             Respighi:Pines of Rome       226
343      344  Schubert: The Late String Quartets & String Qu...       272
344      345                                Monteverdi: L'Orfeo       273
345      346                              Mozart: Chamber Music       274
346      347  Koyaanisqatsi (Soundtrack from the Motion Pict...       275

[347 rows x 3 columns]

In [17]:
#select column dari database
pd.read_sql_query("select AlbumId from albums", conn_1)

     AlbumId
0          1
1          4
2          2
3          3
4          5
..       ...
342      342
343      344
344      345
345      346
346      347

[347 rows x 1 columns]

### 2.3 LIMIT 
Limit digunakan untuk membatasi return value yang di get dari database, mirip seperti head pada pandas

In [18]:
pd.read_sql_query("select AlbumId from albums limit 5", conn_1)

   AlbumId
0        1
1        4
2        2
3        3
4        5

### 2.4 DISTINCT
DISTINCT digunakan untuk mereturn value yang unique dari sebuah kolom yang ada pada tabel

In [19]:
pd.read_sql_query("select distinct ArtistId from albums", conn_1)

     ArtistId
0           1
1           2
2           3
3           4
4           5
..        ...
199       271
200       272
201       273
202       274
203       275

[204 rows x 1 columns]

### 2.5 WHERE 

WHERE digunakan untuk menyatakan kondisi yang diambil dari sebuah kolom pada sebuah table.

In [20]:
pd.read_sql_query("select AlbumId, Title from albums where ArtistId = 271 ", conn_1)

   AlbumId                                              Title
0      342  Locatelli: Concertos for Violin, Strings and C...

### 2.6 AND

And digunakan untuk menambah kondisi yang diperlukan ketika melakukan return dari table, dengan ketentuan setiap kondisi harus bernilai True

In [21]:
pd.read_sql_query("select Title from albums where ArtistId = 271 and AlbumId = 342", conn_1)

                                               Title
0  Locatelli: Concertos for Violin, Strings and C...

### 2.7 OR
And digunakan untuk menambah kondisi yang diperlukan ketika melakukan return dari table, dengan ketentuan salah satu kondisi harus bernilai True

In [22]:
pd.read_sql_query("select ArtistId, AlbumId, Title from albums where ArtistId = 271 or AlbumId = 250", conn_1)

   ArtistId  AlbumId                                              Title
0       271      342  Locatelli: Concertos for Violin, Strings and C...
1       156      250                               The Office, Season 2

### 2.8 IN

In digunakan ketika ingin mengembalikan sebuah value dari sebuah kolom dengan kondisi lebih dari 1, misalnya kita ingin mengembalikan artist id dengan nilai 371, 260 maka kita menggunakan in , sedangkan apabila cuma 1 value kita dapat menggunakan =

In [23]:
pd.read_sql_query("select ArtistId, AlbumId, Title from albums where ArtistId IN(271, 148, 156)  ", conn_1)

   ArtistId  AlbumId                                              Title
0       148      228                                   Heroes, Season 1
1       156      249                               The Office, Season 1
2       156      250                               The Office, Season 2
3       156      251                               The Office, Season 3
4       271      342  Locatelli: Concertos for Violin, Strings and C...

### 2.9 GROUP BY AND AGGREGATION

Group by digunakan untuk mengelompokkan suatu kolom , biasanya groupby didampingi dengan fungsi aggregasi untuk melakukan perhitungan, seperti perhitungan jumlah , ataupun mencari rata-rata, dll.

In [24]:
#mencari jumlah albumId berdasarkan ArtistId
pd.read_sql_query("select ArtistId, count(AlbumId) as jumlah_album from albums group by ArtistId",conn_1)

     ArtistId  jumlah_album
0           1             2
1           2             2
2           3             1
3           4             1
4           5             1
..        ...           ...
199       271             1
200       272             1
201       273             1
202       274             1
203       275             1

[204 rows x 2 columns]

### 2.10 MULTIPLE GROUPBY 
Multiple Groupby dilakukan untuk melakukan group by dengan lebih dari 1 kolom

In [25]:
#mencari jumlah albumId berdasarkan ArtistId
pd.read_sql_query("select Title, ArtistId, count(AlbumId) as jumlah_album from albums group by 1, 2",conn_1)

                                                 Title  ArtistId  jumlah_album
0                               ...And Justice For All        50             1
1    20th Century Masters - The Millennium Collecti...       179             1
2                        A Copland Celebration, Vol. I       230             1
3                           A Matter of Life and Death        90             1
4                                      A Real Dead One        90             1
..                                                 ...       ...           ...
342                                     Warner 25 Anos         6             1
343                       Weill: The Seven Deadly Sins       264             1
344                                             Worlds       202             1
345                                            Zooropa       150             1
346                        [1997] Black Light Syndrome       136             1

[347 rows x 3 columns]

### 2.11 HAVING

Having penggunaan nya sangat mirip dengan where dimana kita melakukan return data berdasarkan kondisi tertentu, bedanya having biasanya didampingin dengan aggregating data , having juga digunakan setelah grouping atau group by sedangkan where digunakan sebelum group by

In [26]:
#mencari jumlah albumId berdasarkan ArtistId
pd.read_sql_query("select ArtistId, count(AlbumId) as jumlah_album from albums group by ArtistId having count(AlbumId) > 2 ",conn_1)

    ArtistId  jumlah_album
0          8             3
1         21             4
2         22            14
3         27             3
4         50            10
5         51             3
6         58            11
7         59             3
8         68             3
9         82             4
10        84             4
11        88             3
12        90            21
13        92             3
14       113             3
15       114             6
16       118             5
17       124             3
18       127             3
19       142             3
20       149             4
21       150            10
22       152             4
23       156             3
24       226             3
25       248             3

### 2.12 ORDER BY 
ORDER BY digunakan untuk mengurutkan atau sorting kolom yang di return dan biasanya diikuti dengan keyword DESC atau ASC untuk menyatakan bentuk kembalian returnya (Descending atau Ascending) default valuenya adalah Ascending

In [28]:
#mencari jumlah albumId berdasarkan ArtistId
pd.read_sql_query("select ArtistId, count(AlbumId) as jumlah_album from albums group by ArtistId having jumlah_album > 1 order by jumlah_album DESC",conn_1)

    ArtistId  jumlah_album
0         90            21
1         22            14
2         58            11
3         50            10
4        150            10
5        114             6
6        118             5
7         21             4
8         82             4
9         84             4
10       149             4
11       152             4
12         8             3
13        27             3
14        51             3
15        59             3
16        68             3
17        88             3
18        92             3
19       113             3
20       124             3
21       127             3
22       142             3
23       156             3
24       226             3
25       248             3
26         1             2
27         2             2
28         6             2
29        11             2
30        12             2
31        16             2
32        18             2
33        19             2
34        42             2
35        52             2
36        53             2
37        54             2
38        76             2
39        77             2
40        80             2
41        81             2
42        99             2
43       101             2
44       110             2
45       130             2
46       131             2
47       137             2
48       139             2
49       143             2
50       145             2
51       146             2
52       147             2
53       208             2
54       245             2
55       252             2

### 2.13 BETWEEN AND 

Between and merupakan keyword yang diguanan untuk mereturn value pada range tertentu.

In [35]:
#mencari jumlah album Id
#mencari jumlah albumId berdasarkan ArtistId
pd.read_sql_query(""" 
                SELECT ArtistId, COUNT(AlbumId) AS jumlah_album
                    FROM albums
                GROUP BY ArtistId
                HAVING jumlah_album BETWEEN 9 AND 22
                ORDER BY jumlah_album DESC""",conn_1)

   ArtistId  jumlah_album
0        90            21
1        22            14
2        58            11
3        50            10
4       150            10

### 2.14 LIKE
Like merupakan keyword yang digunakan untuk mencari berdasarkan kata kunci like diikuti dengan tanda '%'<br>
1. LIKE 'abc%' digunakan untuk mencari kata berawalan abc<br>
2. LIKE '%abc' digunakan untuk mencari kata dengan akhiran abc<br>
3. LIKE '%abc%' digunakan untuk mencari kata yang mengandung abc

In [37]:
pd.read_sql_query(""" 
                SELECT * from albums where
                  title like '%one' """,conn_1)

   AlbumId            Title  ArtistId
0       81       One By One        84
1       95  A Real Dead One        90
2       96  A Real Live One        90

In [38]:
pd.read_sql_query(""" 
                SELECT * from albums where
                  title like 'the%' """,conn_1)

    AlbumId                                             Title  ArtistId
0        13                          The Best Of Billy Cobham        10
1        20  The Best Of Buddy Guy - The Millenium Collection        15
2        47                              The Best of Ed Motta        37
3        48                The Essential Miles Davis [Disc 1]        68
4        49                The Essential Miles Davis [Disc 2]        68
5        50                       The Final Concerts (Disc 2)        58
6        66                               The Battle Rages On        58
7        72                              The Cream Of Clapton        81
8        77                                    The Real Thing        82
9        82                          The Colour And The Shape        84
10      112                           The Number of The Beast        90
11      113                                      The X Factor        90
12      118                    The Return Of The Space Cowboy        92
13      137                The Song Remains The Same (Disc 1)        22
14      138                The Song Remains The Same (Disc 2)        22
15      147                           The Best Of Men At Work       105
16      177                                    The Beast Live       117
17      190                 The Best Of R.E.M.: The IRS Years       124
18      211                                       The Singles       138
19      214                                         The Doors       140
20      215                          The Police Greatest Hits       141
21      238                             The Best Of 1980-1990       150
22      243                     The Best Of Van Halen, Vol. I       152
23      249                              The Office, Season 1       156
24      250                              The Office, Season 2       156
25      251                              The Office, Season 3       156
26      268                             The Best of Beethoven       203
27      280                 The World of Classical Favourites       214
28      290                       The Last Night of the Proms       224
29      332                     The Ultimate Relexation Album       262

In [39]:
pd.read_sql_query(""" 
                SELECT * from albums where
                  title like '%song%' """,conn_1)

   AlbumId                               Title  ArtistId
0      137  The Song Remains The Same (Disc 1)        22
1      138  The Song Remains The Same (Disc 2)        22
2      262                         Quiet Songs       197